<?php
 $news="<tr><td colspan=3><b>20.09.2012</b> - Релиз подготовлен X-ray (10-66-88) для Nulled.cc</td></tr><tr><td colspan=3 align=right><i>X-ray</i><hr></td></tr>
<tr><td colspan=3><b>25.04.2009</b> - в 81 раунде награждаются следующие полководцы:
81 раунд победа красных
Рестарт 27 апреля в 12.00. Планируется запустить два квеста! 

в 81 раунде награждаются следующие полководцы:
Игрок Ganima - Мастер за \&quote;Решительные военные операции в локе Ордосов и Победу Харконенов в 81 раунде\&quote;
Игрок rk - Мастер за \&quote;Перехват инициативы в борьбе за локу Атрейдесов и Победу Харконенов в 81 раунде\&quote;
Игрок дрон - Медаль за отвагу за \&quote;Попытку захвата локи Атрейдесов и сопротивление силам Харконенов\&quote;
</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>15.04.2009</b> - Переезд временно откладывается, пока играем как есть</td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>15.04.2009</b> - Переезд временно откладывается, пока играем как есть</td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>14.04.2009</b> - Доброе утро, уважаемые дюновцы.
Скорей всего с сегодняшнего дня дюна будет не доступна максимум дня на три. Это связано с переездом на другой сервер. Форум пока работать будет, так что всё общение через него.

</td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>09.04.2009</b> - </td></tr><tr><td colspan=3 align=right><i>-Roman-SPb-</i><hr></td></tr>
<tr><td colspan=3><b>07.04.2009</b> - </td></tr><tr><td colspan=3 align=right><i>Freeman</i><hr></td></tr>
<tr><td colspan=3><b>05.04.2009</b> - Рестарт сегодня 05 апреля в 17.00</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>29.03.2009</b> - </td></tr><tr><td colspan=3 align=right><i>UmanetsTaras</i><hr></td></tr>
<tr><td colspan=3><b>28.03.2009</b> - </td></tr><tr><td colspan=3 align=right><i>UmanetsTaras</i><hr></td></tr>
<tr><td colspan=3><b>27.03.2009</b> - </td></tr><tr><td colspan=3 align=right><i>UmanetsTaras</i><hr></td></tr>
<tr><td colspan=3><b>27.03.2009</b> - </td></tr><tr><td colspan=3 align=right><i>UmanetsTaras</i><hr></td></tr>
<tr><td colspan=3><b>27.03.2009</b> - И пришёл фримен к императору, и поведал историю он, что есть люди на песках Аракиса, которые хотят истребить фримена. И сказали они, что если их не перестанут уничтожать, то они уничтожат весь спайс на дюне, Император опечалился таким новостям и сказал своё слово, которое должны услышать все люди дюны. Мудрый император повелевает наказать обидчиков фримена, За это он готов щедро наградить тех людей,которые в этом ему помогут. И будет так!

Объявляется квест! Попробовать себя в деле могут как отдельные игроки, так и группы, никто не останется без внимания. Это задание только для сильных духом и готовых рискнуть состоянием и численностью своих баз и войск, проявить свои полководческие способности и силу воли ради победы своего Дома в войне за спайс планеты Аракис! Суть задания состоит в том, что бы как можно быстрее выдвинуться в тыл любого из игровых Домов и снести топовым по количеству на данный момент баз игрокам хотя бы 50% этих самых баз. Время для квеста всего даётся сутки и оно будет исчисляться с того момента, когда это сообщение будет отправлено. В качестве подтверждения своих действий в тылу врага необходимо: после сноса необходимого количества баз врага удержать хотя бы одну из баз за собой! За выполнение данной части квеста отличившимся игрокам присуждается «Медаль за отвагу». А вот для любителей острых ощущений предусмотрена вторая часть квеста: игроки того Дома, который осмелится вести бои с двумя Домами одновременно на их территории и при этом не даст маху в своем тылу, будут признаны настоящими храбрецами и будут удостоены помимо первой медали еще и второй «Герой Дюны»! Те, кто увлекшись боями, смогут создать условия для победы своего Дома, то есть снести противника, будут удостоены еще и третьей медали «Мастер»! Ну что, где Вы – Герои Дюны, спайс ждет Вас!
Для того, что бы определить фронт работ в зачет будут приниматься войны со следующими, так называемыми «Горячими головами»и обидчиками фрима :):


Атрейдесы
 partizan
andr012
dimlosk

Харконены
UmanetsTaras
belka
Absorber


Ордосы
mash
дрон
foyer
</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>27.03.2009</b> - </td></tr><tr><td colspan=3 align=right><i>UmanetsTaras</i><hr></td></tr>
<tr><td colspan=3><b>20.03.2009</b> - 78 раунд победа зелёных
Рестарт 21 марта в 12.00
</td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>04.03.2009</b> - Форум заработал</td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>02.03.2009</b> - Рестарт будет завтра 03 марта в 12.00, 
в 77 раунде победа за красными</td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>02.03.2009</b> - На сколько, я пока не знаю, ждём найта, боюсь он опять день с ночью перепутал. Как будет известно сообщу заранее, не волнуйтесь</td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>02.03.2009</b> - Походу произошёл сбой, рестарт пока откладывается</td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>01.03.2009</b> -  Мы рады Вам сообщить, что в Дюне 02.0308 - 12:00 будет выполнен рестарт,
в следствии чего предлагаем Вам сыграть новый раунд.
Этот раунд победили красные </td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>31.01.2009</b> - </td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>11.01.2009</b> - </td></tr><tr><td colspan=3 align=right><i>kapitan</i><hr></td></tr>
<tr><td colspan=3><b>10.01.2009</b> - </td></tr><tr><td colspan=3 align=right><i>ince</i><hr></td></tr>
<tr><td colspan=3><b>08.01.2009</b> - </td></tr><tr><td colspan=3 align=right><i>UmanetsTaras</i><hr></td></tr>
<tr><td colspan=3><b>06.11.2008</b> - Мы рады Вам сообщить, что в Дюне 07.11.08 - 11:00 будет выполнен рестарт,
в следствии чего предлагаем Вам сыграть новый раунд.
Вас ждут интерестные изменения в игре. ;)))

С уважением Администрация игры Online DUNE2 - localhost</td></tr><tr><td colspan=3 align=right><i>Wizard</i><hr></td></tr>
<tr><td colspan=3><b>27.10.2008</b> - Рестарт будет 28.10.2008 в 11 утра</td></tr><tr><td colspan=3 align=right><i>Wizard</i><hr></td></tr>
<tr><td colspan=3><b>11.10.2008</b> - Дюна отремонтирована - теперь все строится. 
Подробности бага - праздничные и будут озвучены на завтрашнем оффлайне, который состоится в Москве на территории Парка культуры.
Сбор в 12-00 у главного входа.
На месте звонить по телефону +7 495 5186642 Игорь.</td></tr><tr><td colspan=3 align=right><i>Passreminder</i><hr></td></tr>
<tr><td colspan=3><b>26.08.2008</b> - Просьба не мультить, а уж если играете с одного айпи, то пишите мне в приват.
А то что-то мне параметры некоторых игроков не нравятся. Скоро начну таких банить.</td></tr><tr><td colspan=3 align=right><i>nightmind</i><hr></td></tr>
<tr><td colspan=3><b>26.08.2008</b> - Просьба не мультить, а уж если играете с одного айпи, то пишите мне в приват.
А то что-то мне параметры некоторых игроков не нравятся. Скоро начну таких банить.</td></tr><tr><td colspan=3 align=right><i>nightmind</i><hr></td></tr>
<tr><td colspan=3><b>01.08.2008</b> - Глюкан какой-то ща рестартнем. :)</td></tr><tr><td colspan=3 align=right><i>luk</i><hr></td></tr>
<tr><td colspan=3><b>31.07.2008</b> - 

И пришел к Императору ветер дюн и прошептал ветер: «защити слабых».
И создал Император невидимую и могучую силу и сказал он: «Пусть ни у кого из смертных не будет больше 10 домов!
И пошли Невидимые в свои долгие походы, вычищая пески от неверных.

И сказало им Небо в след: «рано или поздно так или иначе»...


Ибо…
Теперь появляется игрок Invisble. Его армии и базы невидимы. Он развивается как обычный игрок. Он рождается в центре, около Императора. Он нападает на каждую 11-ю базу, созданную любым игроком. Он подчиняется только воле Императора. Он может уничтожать свои базы. Он перемещается обычными методами с обычными скоростями. Проще говоря, это обычный игрок иного дома, имеющий бонус – невидимость.  Его цель – любые базы любого игрока, пока их число не уменьшится до 10.

Следующий раунд играется с этим игроком. Начало - 01.08.08 - 16:00</td></tr><tr><td colspan=3 align=right><i>luk</i><hr></td></tr>
<tr><td colspan=3><b>25.06.2008</b> - Как все уже успели заметить, в нашу замечательную браузерную стратегию приходит очень мало новых игроков. Этому есть вполне логичное объяснение - с точки зрения поисковиков онлайн стратегия Дюна является тематически \&quote;пустым\&quote; сайтом, поскольку все интересные события происходят после авторизации, а туда поисковые роботы не могут попасть.

Собственно предложение для патриотов Дюны - написать небольшие описания игры, либо вольные рассказы о собственных подвигах на онлайн песках Дюны объемом не менее 1 страницы и прислать их на e-mail - help@localhost либо support@localhost либо в личку на форуме. Лучшие тексты будут опубликованы на сайте (возможно подвергнутые корректировке). Поверьте, это действительно поможет нашей онлайн стратегии.

P.S. желательно в текстах употреблять время от времени следующие ключевые слова:

браузерная стратегия
игры стратегии
стратегии игры
on line стратегии
онлайн стратегии
онлайн игры стратегии
бесплатная онлайн стратегия
браузерные онлайн стратегии
экономическая онлайн стратегия
стратегия онлайн бесплатно
онлайн рпг стратегии
новая онлайн стратегия</td></tr><tr><td colspan=3 align=right><i>Wizard</i><hr></td></tr>
<tr><td colspan=3><b>08.06.2008</b> - </td></tr><tr><td colspan=3 align=right><i>Strelok</i><hr></td></tr>
<tr><td colspan=3><b>06.06.2008</b> - Как все уже успели заметить, в нашу замечательную браузерную стратегию приходит очень мало новых игроков. Этому есть вполне логичное объяснение - с точки зрения поисковиков онлайн стратегия Дюна является тематически \&quote;пустым\&quote; сайтом, поскольку все интересные события происходят после авторизации, а туда поисковые роботы не могут попасть.<br><br>

Собственно предложение для патриотов Дюны - написать небольшие описания игры, либо вольные рассказы о собственных подвигах на онлайн песках Дюны объемом не менее 1 страницы и прислать их на e-mail - help@localhost либо support@localhost либо в личку на форуме. Лучшие тексты будут опубликованы на сайте (возможно подвергнутые корректировке). Поверьте, это действительно поможет нашей онлайн стратегии.
<br><br>
P.S. желательно в текстах употреблять время от времени следующие ключевые слова:
<br><br>
браузерная стратегия<br>
игры стратегии<br>
стратегии игры<br>
on line стратегии<br>
онлайн стратегии<br>
онлайн игры стратегии<br>
бесплатная онлайн стратегия<br>
браузерные онлайн стратегии<br>
экономическая онлайн стратегия<br>
стратегия онлайн бесплатно<br>
онлайн рпг стратегии<br>
новая онлайн стратегия<br></td></tr><tr><td colspan=3 align=right><i>Wizard</i><hr></td></tr>
<tr><td colspan=3><b>03.06.2008</b> - Рестарт будет выполнен: 04.06.08 - 15:00. В 56-м раунде победили синие.</td></tr><tr><td colspan=3 align=right><i>luk</i><hr></td></tr>
<tr><td colspan=3><b>02.06.2008</b> - test</td></tr><tr><td colspan=3 align=right><i>luk</i><hr></td></tr>
<tr><td colspan=3><b>19.07.2006</b> - Проведены следующие изменения в игре:

1. Введен запрет на атаку БАЗ СВОЕГО дома.
2. Отключено автосоздание баз после рестарта.
3. При доставке груза космопортом на свою базу, приходит только одно сообщение.
4. Исправлен баг с удалением мертвяков. Мертвяки БУДУТ удаляться автоматически, как раньше.
5. Удалены незаконно выданные медали.
6. Харвы наконец-то поехали по песку в сопровождении солдат, в связи с
этим:
-  при пополнении армии харвами ранг армии не сокращается
-  при уничтожении вражеской армии с харвами, харвы врага переходят в
пользование победившей армии и наоборот.
-  при постройке базы из МКЦ, если в текущей армии есть харвы, они
автоматически въезжают на построенную базу.
7. Добавлено выделение просматриваемой страницы во внутренней почте.

тестируем!!!
баги и впечатления сообщаем игроку luk по внутридюновой почте.</td></tr><tr><td colspan=3 align=right><i>luk</i><hr></td></tr>
<tr><td colspan=3><b>06.07.2006</b> - Довожу всех до сведения, что исправлен глюк с пересылкой через космопорты, теперь груз будет возвращаться назад, а если база-отправитель тоже захвачена, то груз пойдет на любую другую базу игрока, отправлявшего груз, если же у игрока больше нет баз, то груз погибнет (от нехватки горючего).<br>
Теперь если сменить дом или уничтожить все свои базы, можно создать новую базу в любой координате своего дома. Т.е. координаты теперь можно указывать непосредмтванно при создании первой базы, а не только при регистрации.<br>
Так же в этом раунде, будет введено перемещение харвов по песку, планируется это нововведение ввести до 300 дня.<br>
С опытом предыдущих проблем, вводится архивирование игры каждый день (реальный день), теперь если и случится что-то с сервером мы сможем откатить не неделю, а всего один день.<br>
Сделаны так же мелкие доработки, которые вы заметите в процессе игры.<br>
Удачи в игре!!!</td></tr><tr><td colspan=3 align=right><i>dark_avenger</i><hr></td></tr>
<tr><td colspan=3><b>05.07.2006</b> - Рестарт будет 06.07.2006 в 22.00</td></tr><tr><td colspan=3 align=right><i>dark_avenger</i><hr></td></tr>
<tr><td colspan=3><b>04.07.2006</b> - Внимание! На сервере произошел сбой! 
В связи с тем, что архив делается раз в неделю, последняя копия у нас за 30.06.06 число. Так что база игры восстановлена на тот момент.</td></tr><tr><td colspan=3 align=right><i>dark_avenger</i><hr></td></tr>
<tr><td colspan=3><b>28.06.2006</b> - Внимание! База Cydonia перенесена в координаты 75:100.
Это связано с расширением границ Дюны.</td></tr><tr><td colspan=3 align=right><i>dark_avenger</i><hr></td></tr>
<tr><td colspan=3><b>28.06.2006</b> - Внимание, 28.06.06 в 2 часа ночи произошел сбой, в результате чего на некоторых базах перестало хватать энергии, проблема решена в 9 часов утра.</td></tr><tr><td colspan=3 align=right><i>dark_avenger</i><hr></td></tr>
<tr><td colspan=3><b>27.06.2006</b> - Пофиксил баг с электроэнергией, теперь ветряная установка не кушает электричество.</td></tr><tr><td colspan=3 align=right><i>dark_avenger</i><hr></td></tr>
<tr><td colspan=3><b>26.06.2006</b> - Добавил новую возможность для удбства просмотра сообщений, теперь в меню Дополнительные опции можно будет изменять сколько макс. сообщений показывать</td></tr><tr><td colspan=3 align=right><i>dark_avenger</i><hr></td></tr>
<tr><td colspan=3><b>26.06.2006</b> - По многочисленным просьбам возвращен дизбаланс до 10 игрков</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>20.06.2006</b> - Сделал новое поле - прибыль<br>
там через дефис отображается минимальный и максимальный доход базы за 1 ход!<br>
ваш доход будет в середине этих чисел...<br>
<br>
так, для удобства...<br></td></tr><tr><td colspan=3 align=right><i>dark_avenger</i><hr></td></tr>
<tr><td colspan=3><b>13.06.2006</b> - Внимание, важное объявление:<br>
как вы наверно уже видели в новостях написано что аккаунты больше не удаляются даже при рестарте!<br>
в связи с этим у зарегистрированных игроков сразу после рестарта появится база 1 уровня, расположение базы будет согласно дому, в котором зарегистрирован игрок!<br>
Слева-сверху: харконены<br>
Справа-сверху: атрейдесы<br>
Снизу-середина: ордосы<br>

так что регистрироваться можно сейчас...</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>10.06.2006</b> - Ещё мелкие дополнения:
Теперь нельзя будет удалить свой логин, при рестарте он тоже не будет удаляться, при безактивности 1000 дней, будут сноситься все базы и армии, аккаунт остается.
В меню Дополнительные опции; можно будет менять свой дом (с условием уничтожения всех баз и армий).
Теперь на каждого игрока будет вестись статистика, так мы наконец увидим наших ТОПов :). Статистика будет доступна всем для просмотра.</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>10.06.2006</b> - Рестарт будет выполнен 13.06.06 в 10:00,
список изменений смотрите ниже.<br><b><font color=red>Внимание, в связи с технической необходимостью игра не будет доступна в период с 10.06(с вечера) по 13.06(до рестарта).</font></b><br>Победа в текущем раунде присвоена дому ордосов (баланс: 1:10:76:11:3). Поздравляю!</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>31.05.2006</b> - Обновление карты восстановлено, но из-за большой перегрузки сервера, обновление будет делаться раз в 3 часа!</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>31.05.2006</b> - Со следующего раунда, в дюне происходят след. изменения:
<br>
1. Карта дюны увеличиться и будет 150х150 клеток<br>
2. Лимит дизбаланса поднимится до 20 (макс. превышение количества игроков в одном из домов)<br>
3. В дюне появятся границы (перестанет быть круглой как Земля)<br>
4. Двигать армию можно будет на указанное количество клеток (бег на Х клеток - 7,32 и т.п.)<br>
5. Появится новый пункт меню - статистика, там будет таблица армий и таблица баз.
<br><br>
Текущие изменения:
по просьбам игроков изменил максимальное время отсутствия, после чего аккаунт удалялся, теперь
<br>700 дней безактивности - предупреждение
<br>1000 дней безактивности - удаление</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>26.05.2006</b> - <font color=red>Внимание! В связи с многим уже известной проблемой сбоя сервера, база данных игры восстановлена за предыдущий раунд.

В следствии чего, объявляется рестарт 26.05.06 - 20:00!

Приносим свои извенения за доставленные неудобства, эта проблема будет решена и надеюсь больше не повторится!<br>

Желаю удачи!</font></td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>26.05.2006</b> - Внимание запущен квест
<b>Золотой Дворец</b>
описание тут:
</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>25.05.2006</b> - Поправка к правилам о мертвяках:
если игрок неактивен 500 дней, ему присылается уведомлениее
если игрок неактивен 900 дней, он уничтожается</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>23.05.2006</b> - <b>Дополнительно</b><br>
1. Ранг будет прибавляться в зависимости от стоимости нападающей и защищающейся армии, башни тоже учитываются.<br>
2. При пополнении армии из гарнизона ранг будет уменьшаться в зависимости от стоимости добавляемой армии и стоимости оставшейся.<br>
3. Убрал запрет на удаление своего аккаунта.<br>
4. Обратите внимание на характеристики юнитов (справочник по технике), там тоже есть изменения.<br>
5. <font color=red>Нашел способ обнаруживания мультов с точностью 99% - бан без предупреждения, бессрочный. </font><br>
6. При регистрации можно выбрать координаты создания первой базы<br>
7. Исправил ошибки в активации<br>
8. <font color=red>Если игрок неактивен в течении 1440 дней (3р.д.) то он автоматически удаляется, с уничтожением всех баз, армий. Предупреждение делается на 960 дне.</font> подробности в правилах.<br></td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>23.05.2006</b> - <ul><font color=red>Изменения в следующем раунде:</font><br>
<li>Введен новый алгоритм боя
<li>Отключен лимит армии
<li>Войска можно пересылать только на свои базы
<li>Немного измен будет расчет ранга (надеюсь накрутка отпадет)
<li>Будет возможность доукомплектовывать армию
<li>ну и остальные мелкие доработки, которые вам будут практически незаметны.
</ul>
<br>
удачи!<br>
напоминаю, новый раунд начнется 23.05.06 в 14:00 ровно, по системному времени (автоматически)</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>22.05.2006</b> - рестарт будет 23.05.06 в 14.00 по системному времени.</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>18.05.2006</b> - <font color=red>Внимание!</font>
В данном раунде можно создавать альянсы, но аловых армий не будет, потому как не возможно перекидывать войска на чужие базы.</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>17.05.2006</b> - Просьба  при выборе дома ориентироваться на текущий баланс.
nightmind</td></tr><tr><td colspan=3 align=right><i>*Emperor*</i><hr></td></tr>
<tr><td colspan=3><b>10.05.2006</b> - Немного изменил отображение гарнизонов баз, теперь видно их стоимость и отображаются они все сразу.
</td></tr><tr><td colspan=3 align=right><i>dark_avenger</i>
<hr></td></tr>
<tr><td colspan=3><b>08.05.2006</b> - Убрал проверку по IP при регистрации, немного изменил внутреннюю почту, теперь все сообщения и аловые и внутренние отправляются <a href=mes.php>отсюда</a>.
</td></tr><tr><td colspan=3 align=right><i>dark_avenger</i>

<hr></td></tr>
<tr><td colspan=3><b>06.05.2006</b> - В разделе &quote;Дополнительные опции&quote; появилась возможность <u>удалять свой аккаунт</u> и <u>менять пароль</u>. А так же добавлены ограничения на используемые символы в именах пользователей, в названиях баз, армий и альянсов. Теперь с одного IP адреса можно регистрировать только один аккаунт. Ну и закрыл немного дыр.
</td></tr><tr><td colspan=3 align=right><i>dark_avenger</i>
<hr></td></tr>";
?>