<?

$war_n[21]="<b>Харвестер</b>";
$war_c[21]=2;
$war_a1[21]=0;
$war_a2[21]=0;
$war_hp[21]=1000;

$war_n[22]="<b>Передвижной Командный Центр</b>";
$war_c[22]=2;
$war_a1[22]=0;
$war_a2[22]=0;
$war_hp[22]=1000;

$war_n[23]="<b>Легкая пехота</b>";
$war_c[23]=1;
$war_a1[23]=3;
$war_a2[23]=1;
$war_hp[23]=50;

$war_n[24]="<b>Тяжелая пехота</b>";
$war_c[24]=1;
$war_a1[24]=2;
$war_a2[24]=9;
$war_hp[24]=85;

$war_n[25]="<b>Танк</b>";
$war_c[25]=2;
$war_a1[25]=43;
$war_a2[25]=90;
$war_hp[25]=900;

$war_n[26]="<b>Ракетный танк</b>";
$war_c[26]=2;
$war_a1[26]=270;
$war_a2[26]=90;
$war_hp[26]=2200;

$war_n[27]="<b>Сардукар</b>";
$war_c[27]=1;
$war_a1[27]=10;
$war_a2[27]=20;
$war_hp[27]=200;

$war_n[28]="<b>Разрушитель</b>";
$war_c[28]=2;
$war_a1[28]=75;
$war_a2[28]=90;
$war_hp[28]=7500;

$war_n[29]="<b>Фримен</b>";
$war_c[29]=1;
$war_a1[29]=20;
$war_a2[29]=12;
$war_hp[29]=150;

$war_n[12]="<b>Оружейная башня</b>";
$war_c[12]=1;
$war_a1[12]=270;
$war_a2[12]=120;
$war_hp[12]=3000;

$war_n[13]="<b>Ракетная башня</b>";
$war_c[13]=2;
$war_a1[13]=270;
$war_a2[13]=480;
$war_hp[13]=6000;

?>