<?
extract($_GET);
extract($_POST);
 include "header.php"; ?>

<br>
<blockquote>
<h1>Как играть в <b>Dune-2 on-line </b></h1>
<h2><b>Введение. </b></h2>
В самом начале игры Вы получаете незащищенную базу и немного ресурсов. <br>
На базе у Вас есть командный центр и завод по переработке спайса (оба строения первого уровня). <br>
Начальных ресурсов Вам хватит чтобы построить какое-нибудь здание (спайс-силос или электростанцию) или харвестер. Рекомендую строить именно харвестер – это вдвое увеличит добычу спайса, а следовательно и кредитов. <br>
<h2><b>Экономика. </b></h2>
Т.к. все в игре имеет свою цену, то качество развития уместно измерять в получаемых за игровой день кредитах и граните. <br>
Кстати, один игровой день длится три реальных минуты. <br>
С Гранитом все просто – на каждый уровень командного центра Вы получаете 2-6 единиц гранита. <br>
Кредиты в игре могут быть заработаны тремя способами – захват базы противника, усовершенствование командного центра (+10 кредитов в игровой день за каждый уровень) или космопорта (+20 кредитов в игровой день за каждый уровень), и третий – самый прибыльный способ – добыча спайса. <br>
Спайс добывается харвестерами и на очистительных заводах преобразуется в кредиты. Если спайса добывается слишком много и завод не справляется с его переработкой – спайс скапливается в силосах. <br>
Каждый харвестер добывает в игровой день 3 единицы спайса (которые после переработки преобразуется в 3 кредита). Количество спайса добываемого каждым харвестером может быть увеличено при изучении соответствующей технологии в научном центре. <br>
<h2><b>Постройки и технологии. </b></h2>
<b> </b>Все возможные постройки можно условно разделить на военные и гражданские. К военным относятся: оборонительная стена, оружейные и ракетные башни, к гражданским – все остальные. О назначении гражданских зданий можно узнать из их описания, военные здания используются только в случае атаки на Вашу базу. Оборонительная стена и Технология улучшения брони увеличивают броню всех боевых единиц гарнизона на 10% на каждый уровень строения и технологии. Башни являются особым видом боевых единиц – они гораздо мощнее любой техники и уничтожаются только после уничтожения армии, что дает им больший шанс максимально поразить армию атакующего. <br>
Дополнительно к улучшению брони можно исследовать улучшение атаки боевых единиц. Каждый уровень развития технологии добавит им по 10% к наносимому урону. <br>
Для исследования технологий обязательно должен быть построен научный центр. Максимальный уровень того или иного строения определяется как уровнем научного центра, так и уровнем особого здания, специфичного для данной технологии (к примеру – развитие технологии строительства связано с уровнем командного центра). <br>
<h2><b>Сражения </b></h2>
Сражения в игре делятся на два вида – простые сражения и осады. Все сражения проходят по фазам. <br>
При обычном сражении первой атакует нападающая армия, при осаде первой атакует защищающаяся база. <br>
Для каждой боевой единицы определен уровень повреждений, который она может нанести вражеской пехоте или технике. В начале фазы боя каждая боевая единица выбирает наиболее сильного противника, на которого она сможет наиболее эффективно произвести атаку (это не касается башен при осаде базы, они атакуются последними). <br>
Фазы боя повторяются пока одна из армий не будет уничтожена. <br>
При победе армия увеличивает свой ранг. Каждая единица ранга добавляет 2% к наносимым армией повреждениям. <br>
<h2><b>Торговля </b></h2>
<b> </b>С помощью космопортов можно принимать и отправлять кредиты, гранит и военную технику на другие базы, где есть космопорты. <br>
Используйте эту возможность для торговли или помощи союзникам. <br>
<h2><b>Битва за Дюну </b></h2>
Игра предусматривает соперничество между домами Атрейдесов, Ордосов и Харконненов и заканчивается когда один из домов безраздельно властвует Дюной (для этого не обязательно уничтожать всех противников, главное достичь непреодолимого другими игроками преимущества). <br>
Не смотря на то, что союзничество армий одного дома предполагается – никто не гарантирует отсутствия измен и предательств. <br>
Когда один из домов побеждает – игра перезапускается, а победители получают ценные призы от Интернет-холдинга TowerPortal и их великие имена увековечиваются на доске почета игры. <br>
</blockquote>

<? include "footer.php"; ?>

