<?
extract($_GET);
extract($_POST);
 include "header.php"; ?>

<b>Правила игры</b>
<br><br>
<b>Основные правила</b>
<ol>
<li>Игра является собственностью ее создателей (что очевидно) и, как следствие, создатели игры в праве не отвечать на любые претензии игроков, касающиеся работы системы или действий других игроков.
<li>Создатели игры не выступают судьями, гарантирующими честность, тактичность и корректность игроков системы.
<li>Создатели игры оставляют за собой право изменять или удалять аккаунты игроков или части аккаунтов на свое усмотрение и без объяснения причин.
<li>Игрок должен проявлять активность хотя-бы 1 раз в 1000 игровых дней, если нет никакой активности в течении 700 ировых дней, игроку делается предупреждение по внутренней почте. 
Активностью считается: <ul>
<li>Постройка каких-либо строений
<li>Покупка техники и пехоты
<li>Заказ техники и пехоты в гильдии
<li>Пересылка ресурсов, техники и пехоты через космопорт
<li>Шпионаж
<li>Приказы армии
<li>Исследования в науке
</ul>
</ol>

<b>Игрокам запрещается</b>
<ol>
<li>Использовать ненормативную лексику.
<li>Регистрировать более одного аккаунта для одного игрока.
<li>Пытаться каким-либо образом: "взломать" систему, использовать ботов, использовать обнаруженные баги или уязвимости в системе.  
<li>Не сообщать создателям игры о найденных багах, уязвимостях, возможностях взлома.
<li>Любое программное обращение к игре. Игра должна проводиться исключительно через браузер самим игроком и ни как иначе.
</ol>


<? include "footer.php"; ?>
